#8 основных типов данных Python: 
#1) изменямые типы данных
#2) неизменямые типы данных


#они:
#1) Целый числовой типы данных (int)
    #a) float - числа с плавающей точкой
    #б) complex - числа с буквенным выражением (123412n)

#2) str  строковой тип данных ('строка')

#3) bool - булеовй тип данных/ логический (True| False)

#4) list - список ([ ]) изменямый (mutable)

#5) tuple - кортеж / неизменямый список (( ))

#6) set - множество ({ }) изменямый (mutable)

#7) dict - словарь ({ })  изменямый (mutable)

#8) NoneType  - тип данных для обозначения отсутсвия значения (None)


#print ('Hello World!')
#a = 1
#print (a)

 # - это однострочнные комментарий
""" много 
 стронный 
 длинный 
 комментарий"""

#Переменные: 

# a = 10 #ok
# !@##$myvar = 10 # Error
# 12myvar = 10 # Error
# Название переменные не должно начинаться со спец символов и цифр

# my_num = 20 # ok - snake_case
#myNum = 20 # ok - camel_case

# my-num = 1 # Error
# my num = 1 # Error

# Название переменные не должно совподать с названиями с названиями ключевый слов Python
# print = 10 # Error
# if = 10 # Error


# MY_CONST = 10 # Обозначение константы

# num = 10
# a = 10 # нельзя так указать читающему трудно будет понять
# должны написать переменные более понятливые и логические чтобы другие с легкостью читали код


""" 
Функции для вывода (print) и ввода (input) данных в терминал
"""
#print () #- функция для вывода информации в терминал
#input () # - функция для ввода информации с клавиатуры/ в терминал. По умаолчанию отдает строчный тип данных(str)
#type () # - функция для вывода типа переданных в нее данных

# () - обознчают вызов фукции, таакже служит вместилищем для передачи данныnum = 10
#num = 10
#print (num)
#print(type (num))
#input ()

#info = (input)
#print(info)



